# Простое присваивание
a = 5
print(a)

# Сложение с присваиванием
a = 5
a += 2   # Эквивалентно a = a + 2
print(a)   # Теперь a = 7

# Вычитание с присваиванием
a = 5
a -= 2   # Эквивалентно a = a - 2
print(a)   # Теперь a = 3

# Умножение с присваиванием
a = 5
a *= 2   # Эквивалентно a = a * 2
print(a)   # Теперь a = 10

# Деление с присваиванием
a = 5
a /= 2   # Эквивалентно a = a / 2
print(a)   # Теперь a = 2.5

# Целочисленное деление с присваиванием
a = 5
a //= 3   # Эквивалентно a = a // 3
print(a)   # Теперь a = 1

# Остаток от деления с присваиванием
a = 5
a %= 2   # Эквивалентно a = a % 2
print(a)   # Теперь a = 1
